## Import libraries and files

In [54]:
# import libraries
import pandas as pd
import numpy as np
import os

In [56]:
# path
path = r'/Users/michele/Desktop/CF/files/Module4/Instacart'

In [58]:
# import files
df_ord = pd.read_csv(os.path.join(path, 'Data', 'Original', 'orders.csv'), index_col = False)

In [60]:
df_prod = pd.read_csv(os.path.join(path, 'Data', 'Original', 'products.csv'), index_col = False)

In [62]:
df_dep = pd.read_csv(os.path.join(path, 'Data', 'Original', 'departments.csv'), index_col = False)

## Data Wrangling

In [64]:
# dropping eval_set column from orders
df_ord = df_ord.drop(columns = ['eval_set'])

In [66]:
df_ord.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [68]:
# renaming order_dow column
df_ord.rename(columns = {'order_dow' : 'order_days_of_week'}, inplace = True)

In [70]:
df_ord.head()

,order_id,user_id,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [72]:
# changing order_id data type
df_ord['order_id'] = df_ord['order_id'].astype('str')

In [74]:
df_ord['order_id'].dtype

dtype('O')

In [76]:
# first look at departments file
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [78]:
# transposing df_dep
df_dep_t = df_dep.T

In [80]:
df_dep_t

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [51]:
# change header for df_dep_t

In [82]:
# adding index
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [84]:
# new header
new_header = df_dep_t.iloc[0]

In [86]:
# deleting duplicate row
df_dep_t_new = df_dep_t[1:]

In [88]:
# adding new header
df_dep_t_new.columns = new_header

## Data Dictionary

In [92]:
# create a data dictionary
data_dict = df_dep_t_new.to_dict('index')

In [94]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

## Task2

In [96]:
# Find another variable in df_ords that doesn’t need to be in your analysis and change it to a suitable format
df_ord.head()

,order_id,user_id,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [98]:
# change format for user_id
df_ord['user_id'] = df_ord['user_id'].astype('str')

In [100]:
df_ord['user_id'].dtype

dtype('O')

## Task3

In [102]:
# Look for a variable in df_ord with an unintuitive name and change it without overwriting the df
df_ord.rename(columns = {'order_number' : 'order_number_per_client'})

,order_id,user_id,order_number_per_client,order_days_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

## Task4

In [104]:
# Find the frequency of the busiest hour for placing orders and share your findings
df_ord['order_hour_of_day'].value_counts(dropna = False)

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

<b>Finding<b>

the busiest hour of the day for placing orders is at 10:00

## Task5

In [106]:
# Determine the meaning behind a value of 4 in the "department_id" using a data dictionary
print(data_dict.get('4'))

{'department': 'produce'}

## Task6

In [108]:
# Create a subset containing only breakfast item sales
df_breakfast = df_prod[df_prod['department_id'] == 14]

In [110]:
df_breakfast

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6
...,...,...,...,...,...
49330,49326,Cereal Variety Fun Pack,121,14,9.1
49395,49391,Light and Fluffy Buttermilk Pancake Mix,130,14,2.0
49547,49543,Chocolate Cheerios Cereal,121,14,10.8
49637,49633,Shake 'N Pour Buttermilk Pancake Mix,130,14,14.2
49667,49663,Ultra Protein Power Crunch Peanut Butter N' Ho...,57,14,10.2

## Task7

In [112]:
# Find all observations that include items from: alcohol, deli, beverages, and meat/seafood
df_client = df_prod.loc[df_prod['department_id'].isin([5,7,12,20])]

In [114]:
df_client

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1
...,...,...,...,...,...
49676,49672,Cafe Mocha K-Cup Packs,26,7,6.5
49679,49675,Cinnamon Dolce Keurig Brewed K Cups,26,7,14.0
49680,49676,Ultra Red Energy Drink,64,7,14.5
49686,49682,California Limeade,98,7,4.3
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3

## Task8

In [116]:
# How many rows does the last dataframe you created have?
df_client.shape

(7650, 5)

df_client has 7650 rows and 5 columns

## Task9

In [118]:
# Extract all the information about user_is 1
df_user1 = df_ord.loc[df_ord['user_id'].isin(['1'])]

In [120]:
df_user1

,order_id,user_id,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

## Task10

In [122]:
# What basic stats can you provide about user1?
df_user1.describe()

,order_number,order_days_of_week,order_hour_of_day,days_since_prior_order
count,11.000000,11.000000,11.000000,10.000000
mean,6.000000,2.636364,10.090909,19.000000
std,3.316625,1.286291,3.477198,9.030811
min,1.000000,1.000000,7.000000,0.000000
25%,3.500000,1.500000,7.500000,14.250000
50%,6.000000,3.000000,8.000000,19.500000
75%,8.500000,4.000000,13.000000,26.250000
max,11.000000,4.000000,16.000000,30.000000

<b>Findings<b>

The user made 11 purchases in total. All the purchases were made from Monday to Thursday, the customer perfers to shop in the morning or early afternoon. The frequency of purchases is quite infrequent, one purchase every 19 days.

## Export Data

In [124]:
# exporting df_ord
df_ord.to_csv(os.path.join(path, 'Data','Prepared', 'orders_wrangled.csv'))

In [126]:
# exporting df_det_t_new
df_dep_t_new.to_csv(os.path.join(path, 'Data', 'Prepared', 'departments_wrangled.csv'))